%%%-------------------------------------------------------------------
%%% @author erlang
%%% @copyright (C) 2020, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 24. Jan 2020 12:37
%%%-------------------------------------------------------------------
-module(p04).
-author("erlang").

%% API
-export([len/1]).

%%P04 (*) Посчитать количество элементов списка:
%%Пример:
%%1> p04:len([]).
%%0
%%2> p04:len([a,b,c,d]).
%%4
len([])->0;
len([_ | T])->
  len(T, 1).
len([], Acc)->Acc;
len([_ | T], Acc)->
  len(T, Acc + 1).